<script lang="ts"></script>

<pre>
1. 目的
  1.1. 本規約は、当ウェブサービス（以下「本サービス」といいます）の利用条件及び、本サービスの利用に関する利用者と当サービス提供者との間の権利義務関係を定めることを目的とする。

2. 定義
  2.1. 「利用者」とは、本規約に同意の上、本サービスを利用するすべての個人、法人その他の団体をいう。
  2.2. 「投稿」とは、利用者が本サービス上に送信するすべての情報、データ、文章、画像その他一切のコンテンツをいう。
  2.3. 「AGPL3.0」とは、GNU Affero General Public License version 3.0をいう。

3. ライセンス、難読化及びソースコードの取扱い
  3.1. 本サービスは、AGPL3.0に定められた条件の下に提供されるものであり、当サービスの内容の要約、転載、又は他媒体へのコピー等を自由に行うことができるものとする。
  3.2. 但し、利用者が当サービス上の投稿又はコンテンツ等を他のシステムの一部に組み込む行為、又はアフィリエイトによるまとめサイト等に掲載する場合には、その際に使用した製品（例：まとめツール等）の名称、バージョンその他必要な情報を、当サービス提供者に対して開示する義務を負うものとする。
  3.3. 本サービスの安全性及び利用者の個人情報保護の観点から、脆弱性が発見された場合に荒らし行為や個人情報の流出等の被害を未然に防止するため、プログラムには意図的に難読化処理が施されている。これにより、GitHub、Glitchその他一般に公開されるリポジトリにおいて、元のソースコードの閲覧、入手又は再利用は認められないものとする。
  3.4. 利用者は、本サービスに関連して、技術的制限手段（難読化等を含む）の無効化、並びに当該技術的制限手段無効化装置の提供その他これらの回避を目的とする一切の行為、すなわちリバースエンジニアリング又は難読化解除の試みを行ってはならないものとする。

4. 利用者の責任
  4.1. 利用者は、自己の責任において本サービスを利用し、投稿するすべての情報について、その正確性、信頼性及び適法性を確保するものとし、当該投稿に起因して生じた一切の損害（直接的、間接的、特別、偶発的、結果的損害を含む）について、原則として当該利用者自身が責任を負うものとする。
  4.2. 当サービス提供者は、司法機関等からの情報提供要求又は法令に基づく措置として、該当する投稿の削除その他必要な措置を講ずる義務を負う場合があるが、これによって利用者の利益が不当に侵害されることを意図するものではない。

5. 禁止事項
  利用者は、本サービスの利用に際し、以下の各号に該当する行為を行ってはならない。違反が認められた場合、当サービス提供者は、当該利用者の投稿の削除、利用停止、アカウントの抹消及びIPアドレスによるアクセス制限等の措置を講ずる権利を有する。
  5.1. 【刑事罰の対象となる行為】
       5.1.1. 殺害予告、爆破予告、わいせつ物の掲示、不正プログラムの頒布など、現行法令に基づき刑事処罰の対象となる一切の行為。
       5.1.2. 特定個人に対し実名を用いて行われる誹謗中傷、名誉毀損、プライバシーの侵害その他、個人の社会的信用及び人格権を著しく毀損する行為。
       5.1.3. 脅迫、詐欺、扇動行為、その他公共の秩序又は善良な風俗を著しく乱す行為等、現行法令により刑事罰の適用が認められる全ての行為。
  5.2. 【不特定多数に不快感を与える行為】
       5.2.1. 人種、信条、政治的立場、性的指向等に基づく差別、または特定の集団に属する者が不快感を覚える投稿。
       5.2.2. 一般にわいせつ物と認められない場合であっても、糞尿の画像、グロ画像、蓮コラ画像、又は不快害虫の画像等を掲示し、不特定多数に不快感を与える行為。
       5.2.3. 自殺、自傷行為、またはそれを示唆・助長する内容の投稿、およびこれらに関する方法の共有や扇動行為。
  5.3. 【通常の利用範囲を逸脱する行為及び技術的制限の回避行為】
       5.3.1. 自動クローラー等を用いた、投稿の収集行為。
       5.3.2. 分散型サービス妨害（DDoS）攻撃等により、本サービスに過度の負荷をかける行為。
       5.3.3. APIを直接curl等で呼び出し、システムの脆弱性を探査する行為。
       5.3.4. マルウェアを含む、又は不正な動作を助長する、本サービスのURL上で動作するブラウザ拡張機能等の配布行為。
       5.3.5. VPN、Tor等を用いて、当サービス提供者が講じるアクセス制限措置を回避する行為。
       5.3.6. 第3.4項に定める技術的制限手段の無効化、及び技術的制限手段無効化装置の提供その他その回避を目的とする行為。
  5.4. 【スパム行為及び無関係な投稿の禁止】
       5.4.1. 議論の趣旨と無関係な話題を用い、継続的に他スレッドへ投稿することにより、該当スレッドの秩序や健全な議論を著しく損なう行為。
       5.4.2. 関連性を欠く画像（特に人物の顔写真等）を、無断で他スレッドに掲示する行為。
       5.4.3. 一方的かつ無差別に多数の投稿を行い、他利用者に混乱や不利益をもたらす、迷惑性の高い投稿行為。
       5.4.4. 利用者の同意を得ることなく、商品やサービスの宣伝、広告、又は勧誘等の商業的行為。
       5.4.5. ブラウザの自動操作等の自動化ツールを用い、投稿やスレッド作成などの操作を自動化する行為。
  5.5. 【不適切サイトへの誘導及び有害リンクの掲示の禁止】
       5.5.1. マルウェア等の有害なソフトウェアが含まれる可能性のあるURLを掲示し、利用者を感染リスクのある環境へ誘引する行為。
       5.5.2. アダルトサイト、違法漫画サイト、onionドメインを有するサイト、違法賭博サイト、違法薬物の販売サイト等、社会的または法令上不適切なウェブサイトへの誘導を目的とするリンクの掲示並びにその宣伝行為。
       5.5.3. 前各号に該当する行為に類似し、利用者に不利益または混乱をもたらす可能性のある、その他一切の不適切リンクの掲示及び誘導行為。

6. 免責事項
  6.1. 本サービスは「現状有姿」（AS IS）の状態で提供され、利用者は自己の責任において本サービスを利用するものとする。
  6.2. 当サービス提供者は、利用者間のトラブル、または本サービスの利用又は利用不能に起因して生じる一切の損害（直接的、間接的、特別、偶発的、結果的損害を含む）について、故意又は重過失が認められない限り、一切の責任を負わないものとする。

7. 利用規約の変更
  7.1. 当サービス提供者は、必要と判断した場合、利用者に対する事前通知なく本規約の全部又は一部を改定することができる。
  7.2. 改定後の本規約は、本サービス上に掲示された時点から効力を生じ、以降本サービスを利用する全ての利用者は、改定後の規約に同意したものとみなされる。

8. 準拠法及び管轄
  8.1. 本規約の解釈及び適用については、日本法を準拠法とする。
  8.2. 本規約に起因又は関連して生じる一切の紛争については、当サービス提供者の所在地を管轄する裁判所を第一審の専属的合意管轄裁判所とする。

9. その他
  9.1. 本規約のいずれかの条項が無効又は執行不能と判断された場合であっても、その他の条項の有効性及び執行可能性には影響を及ぼさないものとする。
  9.2. 利用者は、本規約を熟読の上、同意したものとみなし、初回アクセス又は利用開始の時点から本規約に拘束されるものとする。

10. 施行日
  本利用規約は、2025年2月16日以降、本サービスにアクセス又は利用する全ての利用者に対して、利用開始時より効力を生じるものとする。

以上

最終更新日：2025年2月16日
</pre>
